<!-- eslint-disable no-undef -->
<!-- eslint-disable no-unused-vars -->
<script setup>
    import { ref, watch } from "vue"
    import utils from "@/scripts/utils"
    
    const onlineChatStore = utils.useOnlineChatStore();
    const onelDialogStore = utils.useOnelDialogStore();
    const circleUrl = ref("https://dn-qiniu-avatar.qbox.me/avatar/");

    watch(onlineChatStore,() => {
        circleUrl.value = onlineChatStore.userqq === 0 ? "https://dn-qiniu-avatar.qbox.me/avatar/" : `https://q2.qlogo.cn/headimg_dl?dst_uin=${onlineChatStore.userqq}&spec=5`;
    },{deep:true});

    const aboutExitLogin = () => {
        if (onlineChatStore.logind && onlineChatStore.connection) {
            ElMessageBox.confirm('确定要退出登录吗，你的聊天记录将会丢失？', '系统提示', {
                type: 'warning',
                cancelButtonText: '取消',
                confirmButtonText: '退出登录'
            }).then(() => {
                onlineChatStore.setUserQQ(0);
                onlineChatStore.setLogind(false);
                onlineChatStore.setUserName(null);
                localStorage.removeItem('userqq');
                localStorage.removeItem('username');
                ElMessage({ message: '退出登录成功！', type: 'success' });
            }).catch(() => {});
        } else {
            ElMessage({ message: '你还没有登录到聊天室哦！', type: 'warning' });
        }
    }

    const openPersonalDialog = () => {
        if (onlineChatStore.logind && onlineChatStore.connection) {
            onelDialogStore.setPersonalCenter(true);
        } else {
            ElMessage({ message: '你还没有登录到聊天室哦！', type: 'warning' });
        }
    }

    const backMainChannel = () => {
        if (onlineChatStore.chatChannel !== 0) {
            history.pushState(null,null,"/");
            onlineChatStore.setChatChannel(0);
        }
    };

    const searchFromChannel = () => {
        if (onlineChatStore.logind && onlineChatStore.connection) {
            onelDialogStore.setSearchalCenter(true);
        } else {
            ElMessage({ message: '你还没有登录到聊天室哦！', type: 'warning' });
        }
    }

    const settingFromChatPage = () => {
        if (onlineChatStore.logind && onlineChatStore.connection) {
            onelDialogStore.setSettinglCenter(true);
        } else {
            ElMessage({ message: '你还没有登录到聊天室哦！', type: 'warning' });
        }
    }
    const openGithubSite = () => window.open('https://github.com/yichen9247/Websocket-ChatOnline');
</script>

<template>
    <div id="chat-sidebar">
        <el-avatar class="avatar-info" shape="square" size="small" :src="circleUrl" @click="openPersonalDialog" v-loading="!onlineChatStore.connection" element-loading-background="#dae8f1" :element-loading-spinner="utils.returnLoadingSvg" element-loading-svg-view-box="-10, -10, 50, 50"/>
        <div class="button-sheet">
            <el-space direction="vertical">

                <!-- :style="{ border: onlineChatStore.chatChannel === 0 ? '5px solid #ffffff' : 'none' }" -->

                <el-tooltip class="box-item" effect="dark" content="首页" placement="right">
                    <el-button size="large" @click="backMainChannel">
                        <svg t="1703496364862" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="12843" width="48" height="48"><path d="M468.906667 57.941333a68.394667 68.394667 0 0 1 86.165333 0l399.936 322.624c30.058667 24.234667 35.136 68.693333 11.328 99.328a69.269333 69.269333 0 0 1-37.802667 24.768l-3.712 0.810667 0.021334 361.514667c0 59.370667-44.48 108.48-102.528 113.877333l-4.736 0.362667-4.949334 0.106666H211.370667c-59.84 0-109.056-47.808-112.106667-109.312l-0.106667-5.034666-0.021333-361.514667-2.453333-0.490667c-29.696-6.848-52.16-33.088-53.909334-64.96L42.666667 436.010667c0-21.610667 9.685333-42.026667 26.325333-55.466667z m46.72 50.026667a5.76 5.76 0 0 0-7.253334 0L108.864 431.146667a6.058667 6.058667 0 0 0-2.218667 4.693333c0 3.328 2.624 6.016 5.866667 6.016h18.816c17.536-0.021333 31.744 14.506667 31.744 32.405333v392.533334l0.064 3.392C164.437333 896.533333 185.792 917.333333 211.712 917.333333h599.765333l3.328-0.085333c25.770667-1.322667 46.101333-23.146667 46.101334-49.621333V474.282667c0-17.92 14.208-32.426667 31.744-32.426667h18.816c1.792 0 3.477333-0.832 4.608-2.261333a6.101333 6.101333 0 0 0-0.96-8.426667z m138.133333 564.693333a32 32 0 0 1-3.754667 45.098667C610.858667 750.890667 568.106667 768 522.666667 768c-45.44 0-88.192-17.109333-127.36-50.24a32 32 0 1 1 41.386666-48.853333C464.704 692.650667 493.056 704 522.666667 704c29.589333 0 57.941333-11.349333 85.973333-35.093333a32 32 0 0 1 45.12 3.754666z" fill="#ffffff" p-id="12844"></path></svg>
                    </el-button>
                </el-tooltip>

                <el-tooltip class="box-item" effect="dark" content="频道" placement="right">
                    <el-button size="large" @click="searchFromChannel">
                        <svg t="1703496411458" class="vcon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="14100" width="48" height="48"><path d="M620.48 376.96c-6.08 0-12.32-2.4-16.96-7.04a23.84 23.84 0 0 1 0-33.92l160-160a23.84 23.84 0 0 1 33.92 0c9.44 9.44 9.44 24.64 0 33.92l-160 160c-4.64 4.64-10.72 7.04-16.96 7.04zM828.48 584.96c-13.28 0-24-10.72-24-24v-336c0-13.28 10.72-24 24-24s24 10.72 24 24v336c0 13.12-10.72 24-24 24z" fill="#ffffff" p-id="14101"></path><path d="M764.48 184.96h-336c-13.28 0-24-10.72-24-24s10.72-24 24-24h336c13.28 0 24 10.72 24 24s-10.72 24-24 24z" fill="#ffffff" p-id="14102"></path><path d="M820.48 232.96c-44.16 0-80-35.84-80-80s35.84-80 80-80 80 35.84 80 80-35.84 80-80 80z m0-112c-17.6 0-32 14.4-32 32s14.4 32 32 32 32-14.4 32-32-14.24-32-32-32z" fill="#ffffff" p-id="14103"></path><path d="M620.48 776.96c-224.96 0-408-183.04-408-408 0-110.24 43.36-213.6 122.08-290.88 9.28-9.12 24.32-9.12 33.6 0l548 537.6c9.28 9.12 9.6 24.16 0.64 33.6-77.76 82.24-183.04 127.68-296.32 127.68zM352 129.28c-59.2 66.08-91.36 150.24-91.36 239.68 0 198.56 161.44 360 360 360 92 0 178.08-33.92 244.8-96.16L352 129.28z" fill="#ffffff" p-id="14104"></path><path d="M860.48 952.96h-736c-8.8 0-16.8-4.8-20.96-12.48a23.68 23.68 0 0 1 0.8-24.32l192-304c7.04-11.2 21.92-14.56 33.12-7.52 11.2 7.04 14.56 21.92 7.52 33.12l-168.8 267.2h692.48c13.28 0 24 10.72 24 24s-10.88 24-24.16 24z" fill="#ffffff" p-id="14105"></path><path d="M540.48 952.96c-13.28 0-24-10.72-24-24v-176c0-13.28 10.72-24 24-24s24 10.72 24 24v176c0 13.12-10.72 24-24 24z" fill="#ffffff" p-id="14106"></path></svg>
                    </el-button>
                </el-tooltip>

                <el-tooltip class="box-item" effect="dark" content="仓库" placement="right">
                    <el-button size="large" @click="openGithubSite">
                        <svg t="1703493832460" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="5620" width="48" height="48"><path d="M427.392 853.504a61.44 61.44 0 0 1-1.450667 15.530667 92.586667 92.586667 0 0 1-10.965333 27.605333c-15.061333 25.301333-40.661333 42.154667-73.642667 42.154667-77.653333 0-108.117333-38.101333-146.261333-133.504C169.216 740.693333 157.013333 725.461333 128 725.461333v-85.333333c77.653333 0 108.117333 38.101333 146.261333 133.504 25.856 64.597333 38.058667 79.786667 67.072 79.786667 0-12.373333-0.170667-23.296-0.512-38.144-0.853333-34.816-0.938667-41.941333 0.554667-51.2 0.64-20.352 5.888-34.773333 16.384-49.066667-95.232-20.736-159.445333-63.573333-196.309333-132.992l-13.824-32.426667C134.186667 510.848 128 467.072 128 416.426667c0-58.24 17.749333-110.336 50.944-153.856-10.368-41.386667-8.96-91.989333 13.909333-149.077334l7.466667-18.688 19.2-6.101333c2.56-0.853333 5.632-1.578667 9.301333-2.133333 37.290667-5.888 90.325333 8.106667 159.701334 52.48a565.930667 565.930667 0 0 1 127.274666-14.208c38.741333 0 77.226667 3.882667 114.048 11.605333 67.456-42.24 119.04-55.509333 155.306667-49.92 3.626667 0.597333 6.741333 1.322667 9.258667 2.133333l19.285333 6.101334 7.466667 18.773333c20.010667 50.218667 23.424 96.469333 16.128 136.96C875.434667 296.32 896 352.597333 896 416.512c0 53.888-3.84 94.378667-14.933333 133.802667l-11.733334 32.170666c-30.677333 69.333333-98.304 112.64-202.538666 133.248 10.837333 15.018667 15.872 30.250667 15.872 52.394667v42.666667l-0.042667 42.666666a13.013333 13.013333 0 0 0 0.341333 2.730667L682.666667 938.794667c-36.352 0-63.36-17.706667-76.672-45.653334a88.277333 88.277333 0 0 1-8.661334-40.277333v-84.736c0-3.584-0.128-3.797333-8.832-12.501333-23.296-23.296-33.834667-40.874667-33.834666-72.832v-38.613334l38.4-3.84c114.346667-11.52 176.512-43.221333 197.12-89.6l9.6-26.325333c7.68-27.562667 10.88-61.098667 10.88-107.946667 0-49.706667-17.365333-90.837333-50.218667-123.648L742.4 274.773333l7.381333-24.448c6.528-21.717333 8.106667-47.402667 1.152-76.714666a158.634667 158.634667 0 0 0-3.584 0.938666c-22.826667 6.4-51.370667 20.053333-85.76 43.008l-15.658666 10.453334-18.304-4.522667a467.754667 467.754667 0 0 0-111.829334-13.269333c-42.709333 0-84.906667 5.418667-123.946666 16.042666l-19.029334 5.205334-16.256-11.136c-35.541333-24.32-65.109333-38.826667-88.746666-45.568a158.293333 158.293333 0 0 0-4.864-1.28c-8.234667 33.92-4.992 61.781333 3.413333 82.688l9.984 25.088-18.346667 19.797333C228.693333 332.629333 213.333333 370.986667 213.333333 416.512c0 41.685333 4.864 76.202667 13.824 102.229333l11.178667 26.453334c27.904 52.352 87.168 83.84 192.853333 95.146666l38.144 4.096v38.357334c0 32-10.538667 49.536-33.834666 72.832-8.704 8.704-8.832 8.96-8.832 12.501333l-0.725334 7.893333c-0.512 2.56-0.512 9.258667 0.170667 37.205334 0.298667 12.8 0.469333 22.997333 0.554667 33.621333a33.962667 33.962667 0 0 1 0.725333 6.656z" p-id="5621" fill="#ffffff"></path></svg>
                    </el-button>
                </el-tooltip>

                <el-tooltip class="box-item" effect="dark" content="关于" placement="right">
                    <el-button size="large" @click="utils.aboutThisChatPage">
                        <svg t="1703496071634" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="9471" width="48" height="48"><path d="M512 64c247.424 0 448 200.576 448 448s-200.576 448-448 448S64 759.424 64 512 264.576 64 512 64z m0 85.333333C311.701333 149.333333 149.333333 311.701333 149.333333 512s162.368 362.666667 362.666667 362.666667 362.666667-162.368 362.666667-362.666667S712.298667 149.333333 512 149.333333z m21.333333 277.333334a21.333333 21.333333 0 0 1 21.333334 21.333333v298.666667a21.333333 21.333333 0 0 1-21.333334 21.333333h-42.666666a21.333333 21.333333 0 0 1-21.333334-21.333333V448a21.333333 21.333333 0 0 1 21.333334-21.333333h42.666666z m0-170.666667a21.333333 21.333333 0 0 1 21.333334 21.333333v42.666667a21.333333 21.333333 0 0 1-21.333334 21.333333h-42.666666a21.333333 21.333333 0 0 1-21.333334-21.333333v-42.666667a21.333333 21.333333 0 0 1 21.333334-21.333333h42.666666z" fill="#ffffff" p-id="9472"></path></svg>
                    </el-button>
                </el-tooltip>

                <el-tooltip class="box-item" effect="dark" content="退出" placement="right">
                    <el-button size="large" @click="aboutExitLogin">
                        <svg t="1703494175164" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="7128" width="48" height="48"><path d="M430.938 665.604l59.726 59.728L704 512 490.664 298.666l-59.726 59.73 110.938 110.938H128v85.332h411.728l-108.79 110.938zM810.668 128H213.332C166.396 128 128 166.396 128 213.332V384h85.332v-170.666h597.336v597.336H213.332V640H128v170.668C128 857.604 166.396 896 213.332 896h597.336C857.604 896 896 857.604 896 810.668V213.332C896 166.396 857.604 128 810.668 128z" p-id="7129" fill="#ffffff"></path></svg>
                    </el-button>
                </el-tooltip>

                <el-tooltip class="box-item" effect="dark" content="设置" placement="right">
                    <el-button size="large" @click="settingFromChatPage" data-flex="end">
                        <svg t="1703494205002" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="8280" width="48" height="48"><path d="M469.333333 60.693333a85.333333 85.333333 0 0 1 85.333334 0l326.826666 188.714667a85.333333 85.333333 0 0 1 42.666667 73.898667v377.386666a85.333333 85.333333 0 0 1-42.666667 73.898667L554.666667 963.306667a85.333333 85.333333 0 0 1-85.333334 0L142.506667 774.592a85.333333 85.333333 0 0 1-42.666667-73.898667v-377.386666a85.333333 85.333333 0 0 1 42.666667-73.898667z m42.666667 73.898667L185.173333 323.306667v377.386666L512 889.408l326.826667-188.714667v-377.386666L512 134.592zM512 341.333333a170.666667 170.666667 0 1 1 0 341.333334 170.666667 170.666667 0 0 1 0-341.333334z m0 85.333334a85.333333 85.333333 0 1 0 0 170.666666 85.333333 85.333333 0 0 0 0-170.666666z" fill="#ffffff" p-id="8281"></path></svg>
                    </el-button>
                </el-tooltip>
            </el-space>
        </div>
    </div>
</template>

<style>
    @import url("./styles/ChatSideBars.css");
</style>